load-test/cancel-reservation.yml
---
config:
        target: "https://a412g0v5ef.execute-api.ap-northeast-2.amazonaws.com"
        phases:
                - duration: 10
                  arrivalRate: 5
        defaults:
                headers:
                        Content-Type: "application/json"  
scenarios:
        - flow: 
                - post:
                        url: "/prod/cancel?eventId=DearYouth&seatId=A5&userId=YOUNG"