load-test/heavy-load.yml
---
config:
        target: "https://a412g0v5ef.execute-api.ap-northeast-2.amazonaws.com"
        phases:
                - duration: 10
                  arrivalRate: 100
        payload:
                path: "users.csv"
                fields: 
                        - "number"
        defaults:
                headers:
                        Content-Type: "application/json"
scenarios:
        - flow:
                - post:
                        url: "/prod/reserve"
                        json:
                                eventId: "stress-test"
                                seatId: "seat-{{ number }}"
                                userId: "user-{{ number }}"